export const englishTopicValue = [
  {
    name: "Literature",
    topic: [
      { name: "Literary Terms" },
      { name: "Period of English Literature" },
      { name: "The Old English Period (450-1066)" },
      { name: "The Middle English Period (1066-1500)" },
      { name: "The Renaissance Period (1500-1660)" },
      { name: "The Neo Classic Period (1660-1798)" },
      { name: "The Romantic Period (1798-1832)" },
      { name: "The Victorian Period (1832-1901)" },
      { name: "The Modern Period (1901-1939)" },
      { name: "The Post Modern Period (1901-Present)" },
      { name: "Others" },
    ],
  },
  {
    name: "Grammar",
    topic: [
      {
        name: "Parts of Speech",
        subTopic: [
          "Identifying Parts of Speech",
          "Noun",'Determiner',
          "Number",
          "Gender",
          "Articles and Determiner",
          "Pronoun",
          'Adjective',
          "Degree of Comparison",
          "Verb",
          'Adverb',
          'Preposition',
          "Conjunction",
          "Interjection",
          "Interchange of Parts of Speech",
          'Others'
        ],
      },
      {
        name: "Idioms & Phrases",
        subTopic: [
          "Meanings of Phrases",
          "Kinds of Phrases",
          "Identifying Phrases",'Others'
        ],
      },
      {
        name: "Clauses",
        subTopic: [
          "Principal Clause",
          "Subordinate Clause",
          "Noun Clause",
          "Adjective Clause",
          "The Adverbial Clause & its types",'Others'
        ],
      },
      {
        name: "Corrections",
        subTopic: [
          "Tense",
          "Verb",
          "Preposition",
          'Determiner','Gender','Number','Subject-Verb Agreement',
          'Others'
        ],
      },
      {
        name: "Sentences & Transformations",
        subTopic: [
            'Simple Sentence','Complex Sentence','Compound Sentence','Active Voice','Passive Voice','Positive Degree','Comparative Degree','Superlative Degree','Others'
        ],
      },
      {
        name: "Words",
        subTopic: [
            'Meanings','Synonyms','Antonyms','Spellings','Usage of words as various parts of speech','Formation of new words by adding prefixes and suffixes','Others'
        ],
      },
    ],
  },
];
export const examTypeValue = [
  {
    type: "বিসিএস প্রিলিমিনারি",
    value: [
      "৪৬ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "৪৫ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "৪৪ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "৪৩ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "৪২ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "৪১ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "৪০ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "৩৯ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "৩৮ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "৩৭ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "৩৬ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "৩৫ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "৩৪ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "৩৩ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "৩২ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "৩১ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "৩০ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "2৯ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "2৮ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "2৭ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "2৬ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "2৫ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "2৪ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "2৩ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "2২ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "2১ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "2০ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "1৯ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "1৮ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "1৭ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "1৬ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "1৫ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "1৪ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "1৩ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "1২ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "1১ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "1০ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "৯ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "৮ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "৭ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "৬ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "৫ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "৪ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "৩ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "২ তম বিসিএস প্রিলিমিনারি টেস্ট",
      "১ তম বিসিএস প্রিলিমিনারি টেস্ট",
      // ১২৩৪৫৬৭৮৯০
    ],
  },
  { type: "শিক্ষক নিয়োগ", value: ["শিক্ষক নিয়োগ", "শিক্ষক নিয়োগ"] },
  { type: "ব্যাংক জবস", value: ["ব্যাংক জবস", "ব্যাংক জবস"] },
  {
    type: "ভর্তি পরীক্ষা",
    value: [
      "ঢাকা বিশ্ববিদ্যালয় বিজ্ঞান ইউনিট",
      "ঢাকা বিশ্ববিদ্যালয় কলা ও সামাজিক ইউনিট",
      "ঢাকা বিশ্ববিদ্যালয় ব্যাবসার শিক্ষা ইউনিট",
      "********************************",
      "ইসলামী বিশ্ববিদ্যালয় A ইউনিট",
      "ইসলামী বিশ্ববিদ্যালয় B ইউনিট",
      "ইসলামী বিশ্ববিদ্যালয় C ইউনিট",
      "************************",
      "সাত কলেজ বিজ্ঞান ইউনিট ইউনিট",
      "সাত কলেজ কলা ও সামাজিক ইউনিট",
      "সাত কলেজ ব্যাবসার শিক্ষা ইউনিট",
      "****************************",
      "জগন্নাথ বিশ্ববিদ্যালয় ক ইউনিট",
      "জগন্নাথ বিশ্ববিদ্যালয় খ ইউনিট",
      "জগন্নাথ বিশ্ববিদ্যালয় গ ইউনিট",
      "*************************",
      "রাজশাহী বিশ্ববিদ্যালয় A ইউনিট",
      "রাজশাহী বিশ্ববিদ্যালয় B ইউনিট",
      "রাজশাহী বিশ্ববিদ্যালয় C ইউনিট",
    ],
  },
  {
    type: "বিভিন্ন মন্ত্রণালয়",
    value: ["বিভিন্ন মন্ত্রণালয়", "বিভিন্ন মন্ত্রণালয়"],
  },
  { type: "শিক্ষা অফিসার", value: ["শিক্ষা অফিসার", "শিক্ষা অফিসার"] },
];

export const banglaTopicValue = [
  {
    mainTitle: "সাহিত্য",
    subtitle: true,
    subTitleName: [
      {
        name: "বাংলা সাহিত্যের ইতিহাস",
        topic: [
          "বাঙালি জাতি",
          "বাংলা ভাষার উদ্ভব ও বিকাশ",
          "বাংলা লিপি",
          "বাংলা সাহিত্যের ইতিহাসের যুগবিভাগ",'অন্যান্য'
        ],
      },
      { name: "প্রাচীন যুগ", topic: ["চর্যাপদ"] },
      {
        name: "মধ্য যুগ",
        topic: [
          "অন্ধকার যুগ",
          "শ্রীকৃষ্ণকীর্তন",
          "বৈষ্ণব পদাবলি",
          "মঙ্গলকাব্য",
          "জীবনী সাহিত্য",
          "নাথ সাহিত্য",
          "মর্সিয়া সাহিত্য ",
          "লোকসাহিত্য",
          "অনুবাদ সাহিত্য",
          "রোমান্টিক প্রণয়োপাখ্যান",
          "আরাকান রাজসভা",
          "মধ্যযুগে বাংলা সাহিত্যের পৃষ্ঠপোষক",
          "যুগ সন্ধিক্ষণ",'অন্যান্য'
        ],
      },
      {
        name: "আধুনিক যুগ",
        topic: [
          "বাংলা গদ্যসাহিত্য",
          "ফোর্ট উইলিয়াম কলেজ",
          "শ্রীরামপুর মিশন ও বাংলা ছাপাখানা",
          "হিন্দু কলেজ ও ইয়ংবেঙ্গল ",
          "ঢাকা মুসলিম সাহিত্য সমাজ",
          "বাংলাদেশ এশিয়াটিক সোসাইটি",
          "বাংলা একাডেমি",
          "উপন্যাস",
          "নাটক",
          "প্ৰবন্ধ",
          "বাংলা সাহিত্যের ইতিহাস বিষয়ক গ্রন্থ",
          "ভ্রমণকাহিনী বাংলা কাব্য ও কবিতা",
          "মহাকাব্য ছোট গল্প",
          "জীবনচরিত : মুহম্মদ (স.)",
          "ভাষা আন্দোলনভিত্তিক রচনা",
          "মুক্তিযুদ্ধভিত্তিক গ্রন্থ",
          "বিখ্যাত চরিত্র",
          "বিখ্যাত সাহিত্যিকদের উপাধি",
          "বিখ্যাত সাহিত্যিকদের প্রকৃত নাম ও ছদ্মনাম ",
          "বিশিষ্ট ঔপন্যাসিকদের প্রথম প্রকাশিত উপন্যাস",
          "বিখ্যাত নাট্যকারদের প্রথম প্রকাশিত নাটক",
          "প্রখ্যাত গল্পকারদের প্রথম প্রকাশিত গল্প/গল্পগ্রন্থ ",
          "প্রখ্যাত কবিদের প্রথম প্রকাশিত কাব্যগ্রন্থ",
          "বাংলা সাহিত্যের প্রথম বিষয়াবলি ও প্রকাশনা",
          "বাংলা সাহিত্যের বাজেয়াপ্তকৃত সাহিত্যকর্ম",
          "বাংলা সাহিত্যের উৎসর্গীকৃত সাহিত্যকর্ম",
          "বিখ্যাত বাংলা গান",
          "পত্রিকা / সাময়িকী ও সম্পাদক",'অন্যান্য'
        ],
      },
    ],
  },

  {
    mainTitle: "ব্যাকরণ",
    subtitle: true,
    subTitleName: [
      {
        name: "ব্যাকরণের আলোচ্য বিষয়",
        topic: [
          "বাংলা ভাষা",
          "বাংলা ভাষারীতি ব্যাকরণ",
          "বাংলা ব্যাকরণের আলোচ্য বিষয়",'অন্যান্য'
        ],
      },
      {
        name: "ধ্বনিতত্ত্ব",
        topic: [
          "ধ্বনি ও বর্ণ",
          "বর্ণের / শব্দের উচ্চারণ",
          "ণ-ত্ব বিধান",
          "ষ-ত্ব বিধান",'অন্যান্য'
        ],
      },
      {
        name: "রূপতত্ত্ব বা শব্দতত্ত্ব",
        topic: [
          "সন্ধি",
          "লিঙ্গ",
          "পুরুষ",
          "দ্বিরুক্ত শব্দ / দ্বিত্ব শব্দ",
          "বচন",
          "সংখ্যাবাচক শব্দ",
          "পদাশ্রিত নির্দেশক",
          "সমাস",
          "উপসর্গ",
          "ধাতু প্রকৃতি প্রত্যয়",
          "শব্দ",
          "সমার্থক শব্দ",
          "বিপরীত শব্দ",
          "বিভিন্ন শব্দের প্রতিশব্দ",
          "প্রায় সমোচ্চারিত শব্দ / শব্দজোড়",
          "পদ প্রকরণ",
          "ক্রিয়ার কাল",
          "ক্রিয়ার ভাব",'অন্যান্য'
        ],
      },
      {
        name: "বাক্যতত্ত্ব বা পদক্রম",
        topic: [
          "কারক ও বিভক্তি",
          "বাক্য শুদ্ধিকরণ",
          "বাচ্য",
          "অনুসর্গ বা কর্মপ্রবচনীয় বাক্য",
          "প্রয়োগ-অপপ্রয়োগ",
          "বাক্য সংকোচন / সংক্ষেপণ",'অন্যান্য'
        ],
      },
      {
        name: "অর্থতত্ত্ব বা বাগর্থতত্ত্ব",
        topic: [
          "বাগর্থ ও প্রয়োগ বাগ্ধারা",
          "প্রবাদ-প্রবচন",
          "বাচ্য",
          "বিরাম বা যতি চিহ্ন",
          "পারিভাষিক শব্দ",
          "অনুবাদ অলঙ্কার",
          "ছন্দ",
          "পত্রলিখন",
          "উক্তি",
          "সারাংশ ও সারমর্ম",
          "ভাব-সম্প্রসারণ",'অন্যান্য'
        ],
      },
    ],
  },
];

export const mathTopicValue = [
  {
    name: "পাটি গণিত",
    value: [
      "বাস্তব সংখ্যা",
      "সংখ্যা সম্পর্কিত সমস্যা",
      "গ.সা.গু. এবং ল.সা.গু.",
      "ভগ্নাংশ এবং দশমিক সংখ্যা",
      "বর্গ এবং বর্গমূল",
      "গড়",
      "শতকরা",
      "সরল ও চক্রবৃদ্ধি মুনাফা লাভ ক্ষতি",
      "অনুপাত এবং সমানুপাত মিশ্রণ",
      "অংশীদারি কারবার",
      "বয়স সম্পর্কিত সমস্যা",
      "ঐকিক নিয়ম",
      "সময় ও কাজ",'অন্যান্য'
    ],
  },
  {
    name: "বীজগণিত",
    value: [
      "বীজগাণিতিক সূত্রাবলি",
      "বহুপদী উৎপাদক",
      "সরল ও দ্বিঘাত সমীকরণ",
      "সরল সহসমীকরণ",
      "অসমতা",
      "সূচক ও লগারিদম",'অন্যান্য'
    ],
  },
  {
    name: "জ্যামিতি",
    value: [
      "রেখা, কোণ, ত্রিভুজ ও চতুর্ভূজ সংক্রান্ত উপপাদ্য ",
      "পিথাগোরাসের উপপাদ্য",
      "বৃত্ত সংক্রান্ত উপপাদ্য",
      "বহুভুজ",
      "পরিমিতি",
      "ত্রিকোনোমিতি",
      "স্থানাঙ্ক জ্যামিতি",'অন্যান্য'
    ],
  },
  {
    name: "বিচ্ছিন্ন গণিত",
    value: [
      "সমান্তর ও গুণোত্তর অনুক্রম ও ধারা",
      "সেট",
      "বিন্যাস ও সমাবেশ",
      "পরিসংখ্যান ও সম্ভাব্যতা",'অন্যান্য'
    ],
  },
  {
    name: "গতিবিদ্যা",
    value: ["সময়, দূরত্ব, বেগ", "ট্রেন", "নৌকা ও স্রোত", "চৌবাচ্চা",'অন্যান্য'],
  },
  {
    name: "অন্যান্য",
    value: ["ঘড়ি", "ক্যালেন্ডার", "একক",'অন্যান্য'],
  },
];


export const bangladeshBishay = [
  'বাংলাদেশের প্রাচীন, মধ্যযুগীয় ও আধুনিক ইতিহাস', 'ব্রিটিশ ও পাকিস্তান শাসনামল', 'বাংলাদেশের স্বাধীনতা যুদ্ধ', 'বাংলাদেশের কৃষিজ সম্পদ', 'বাংলাদেশের জনসংখ্যা',
  'বাংলাদেশের অর্থনীতি', 'বাংলাদেশের শিল্প ও বাণিজ্য', 'বাংলাদেশের সংবিধান', 'বাংলাদেশের রাজনৈতিক ব্যবস্থা', 'বাংলাদেশের সরকার ব্যবস্থা', 'বাংলাদেশের জাতীয় অর্জন','অন্যান্য'
];

export const internationalBishay = [
  'বৈশ্বিক ইতিহাস', 'আঞ্চলিক ও আন্তর্জাতিক ব্যবস্থা', 'ভু-রাজনীতি', 'আন্তর্জাতিক নিরাপত্তা ও আন্তরাষ্ট্রীয় ক্ষমতা সম্পর্ক', 'বিশ্বের সাম্প্রতিক ও চলমান ঘটনা প্রবাহ', 'আন্তর্জাতিক পরিবেশগত ইস্যু ও কূটনীতি', 'আন্তর্জাতিক সংগঠনসমূহ এবং বৈশ্বিক অর্থনৈতিক প্রতিষ্ঠানাদি','অন্যান্য'
]

export const science1 = [
  'পদার্থের অবস্থা, এটমের গঠন', 'কার্বনের বহুমুখী ব্যবহার', 'এসিড, ক্ষার, লবণ', 'পদার্থের ক্ষয়', 'সাবানের কাজ', 'ভৌত রাশি এবং এর পরিমাপ',
  , 'ভৌত বিজ্ঞানের উন্নয়ন', 'চৌম্বকত্ব', 'তরঙ্গ ও শব্দ', 'তাপ ও তাপগতিবিদ্যা', 'আলোর প্রকৃতি',
  , 'স্থির ও চলতড়িৎ', 'ইলেক্ট্রনিক্স', 'আধুনিক পদার্থ বিজ্ঞান', 'শক্তির উৎস এবং এর প্রয়োগ', 'নবায়নযোগ্য শক্তির উৎস',
  , 'পারমাণবিক শক্তি ও উৎস', 'খনিজ উৎস', 'শক্তির রূপান্তর', 'আলোক যন্ত্রপাতি', 'মৌলিক কণা',
  , 'ধাতব পদার্থ এবং তাদের যৌগ সমূহ', 'অধাতব পদার্থ', 'জারণ-বিজারণ', 'তড়িৎকোষ', 'অজৈবযৌগ',
  , 'জৈবযৌগ', 'তড়িৎ চৌম্বক', 'ট্রান্সফরমার', 'এক্সরে', 'তেজস্ক্রিয়তা','অন্যান্য'
]
export const science2 = [
  'পদার্থের জীববিজ্ঞান বিষয়ক ধর্ম', 'টিস্যু', 'জেনেটিক্স', 'জীববৈচিত্র্য', 'এনিমেল ডাইভার্সিটি', 'অর্গান এবং অর্গানসিস্টেম', 'সালোকসংশ্লেষণ', 'ভাইরাস', 'ব্যাকটেরিয়া', 'জুওলজিক্যাল নমেনক্লেচার',
  'বোটানিক্যাল নমেনক্লেচার', 'প্রাণীজগৎ', 'উদ্ভিদ', 'ফুল – ফল', 'রক্ত ও রক্তসঞ্চালন', 'হৃৎপিণ্ড ও হৃদরোগ', 'স্নায়ু ও স্নায়ুরোগ', 'খাদ্য ও পুষ্টি', 'ভিটামিন', 'মাইক্রোবায়োলজি',
  'প্লান্ট নিউট্রিশন', 'পরাগায়ন','অন্যান্য'
]
export const science3 = [
  'পৃথিবী সৃষ্টির ইতিহাস', 'কসমিক রে', 'ব্ল্যাক হোল', 'হিগের কণা', 'বারিমণ্ডল', 'টাইড ও বায়ুমণ্ডল', 'টেকটনিক প্লেট', 'সাইক্লোন ও সুনামি', 'বিবর্তন', 'সামুদ্রিক জীবন',
  'মানবদেহ, রোগের কারণ ও প্রতিকার', 'সংক্রামক রোগ', 'রোগজীবাণুর জীবনধারণ', 'মা ও শিশুসাস্থ্য', 'ইম্যুনাইজেশন ও ভ্যাকসিনেশন', 'এইচআইভি ও এইডস', 'টিবিও পোলিও', 'জোয়ার ভাঁটা', 'এপিকালচার', 'সেরিকালচার',
  'পিসিকালচার', 'হরটিকালচার', 'ডায়োড ও Transistor', 'আইসি (IC)', 'আপেক্ষিক তত্ত্ব', 'ফোটন কণা ইত্যাদি','অন্যান্য'
]


export const computer = [
  {
    subject: 'কম্পিউটার',
    topic: [
      'কম্পিউটার পেরিফেরালস- কীবোর্ড, মাউস, ও সিআর ইত্যাদি',
      'কম্পিউটারের অঙ্গ সংগঠন- সিপিইউ, হার্ডডিস্ক, এএলইউ ইত্যাদি',
      'কম্পিউটারের পারফরমেন্স',
      'দৈনন্দিন জীবনে কম্পিউটার- কৃষি, যোগাযোগ, শিক্ষা, স্বাস্থ্য, খেলাধুলা ইত্যাদি',
      'কম্পিউটারের নম্বর ব্যবস্থা',
      'অপারেটিং সিস্টেম', 'এমবেডেড কম্পিউটার', 'কম্পিউটারের ইতিহাস', 'কম্পিউটারের প্রকারভেদ',
      'কম্পিউটার প্রোগ্রাম- ভাইরাস, ফায়ারওয়াল ইত্যাদি', 'ডেটাবেস সিস্টেম।','অন্যান্য'
    ]
  },
  {
    subject: 'তথ্যপ্রযুক্তি',
    topic: [
      'ই-কমার্স',
      'সেলুলার ডাটা নেটওয়ার্ক- টুজি, থ্রিজি, ফোরজি, ওয়াইম্যাক্স ইত্যাদি', 'কম্পিউটার নেটওয়ার্ক- ল্যান, ম্যান, ওয়াইফাই, ওয়াইম্যাক্স ইত্যাদি',
      'দৈনন্দিন জীবনে তথ্যপ্রযুক্তি', 'স্মার্টফোন', 'ওয়ার্ল্ডওয়াইড ওয়েব (www)', 'ইন্টারনেট', 'নিত্যপ্রয়োজনীয় কম্পিউটিং প্রযুক্তি- ইমেইল, ফ্যাক্স ইত্যাদি',
      'ক্লাইন্ট সার্ভার ম্যানেজমেন্ট', 'মোবাইল প্রযুক্তির বৈশিষ্ট্য সমূহ', 'তথ্যপ্রযুক্তির বড় প্রতিষ্ঠান ও তাদের সেবা/তথ্যসমূহ- গুগল, মাইক্রোসফট, আইবিএম ইত্যাদি',
      'ক্লাউড কম্পিউটিং', 'সোশ্যাল নেটওয়ার্কিং- ফেসবুক, টুইটার, ইন্সটাগ্রাম ইত্যাদি', 'সাইবার অপরাধ।','অন্যান্য'
    ]
  }
]

export const mentalAbility = [
  'ভাষাগত যৌক্তিক বিচার (Verbal Reasoning)',
  'সমস্যা সমাধান (Problem Solving)',
  'বানান ওভাষা (Spelling and Language)',
  'যান্ত্রিক দক্ষতা (Mechanical Reasoning)',
  'স্থানাংক সম্পর্ক (Space Relation)',
  'সংখ্যাগত ক্ষমতা (Numerical Ability)','অন্যান্য'
]

// utils/scrollToTop.ts
export const scrollToTop = () => {
  if (typeof window !== "undefined") {
    window.scrollTo({
      top: 0,
      behavior: "smooth",
    });
  }
};
